:orange_circle:
```
sudo docker compose run --rm devops-utils sh -c 'cd components/test-vpc; terraform plan -var-file="../../accounts/infrastructure/network/var.tfvars"'
[0m[1mmodule.vpc.aws_vpc.this: Refreshing state... [id=vpc-07a35b024555ea00e][0m
[0m[1mmodule.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0efe7f4d565d95c5f][0m
[0m[1mmodule.vpc.module.tier["public_subnet"].aws_subnet.this[1]: Refreshing state... [id=subnet-0d7e674ce633ceab3][0m
[0m[1mmodule.vpc.module.tier["public_subnet"].aws_subnet.this[0]: Refreshing state... [id=subnet-049ce40be4510c019][0m
[0m[1mmodule.vpc.module.tier["public_subnet"].aws_subnet.this[2]: Refreshing state... [id=subnet-0bdf17d87760c47d6][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.vpc.aws_internet_gateway.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_internet_gateway" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"Name"  = "devops-igw"
          [32m+[0m [0m"Owner" = "arthur"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m = {
          [32m+[0m [0m"Name"  = "devops-igw"
          [32m+[0m [0m"Owner" = "arthur"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m   = "vpc-07a35b024555ea00e"
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```